package com.mark.oo;

import android.os.Bundle;

import androidx.annotation.Nullable;
import androidx.fragment.app.Fragment;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;

import java.util.ArrayList;
import java.util.List;


/**
 * A simple {@link Fragment} subclass.
 */
public class MkwnatFragment extends Fragment {
    View v;
    RecyclerView recyclerView;
    List<ModelClass> mList2;
    CustomAdabter customAdabter;
    public MkwnatFragment() {
        // Required empty public constructor
    }


    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {
        // Inflate the layout for this fragment
      v= inflater.inflate(R.layout.fragment_mkwnat, container, false);
        recyclerView=v.findViewById(R.id.mkwnatRecycler);
        customAdabter=new CustomAdabter(mList2,getContext());
        recyclerView.setAdapter(customAdabter);
        recyclerView.setLayoutManager(new LinearLayoutManager( getActivity()));
        return v;
    }
    @Override
    public void onCreate(@Nullable Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        mList2=new ArrayList<>();
        mList2.add(new ModelClass(R.drawable.ardu1_1,"ما هو الأردوينو؟","آردوينو: هو عبارة عن لوحه تطوير إلكترونية Development Board تتكون من دارة إلكترونية مفتوحة المصدر Open source مع متحكم دقيق Micro-controller على لوحة واحدة يتم ببرمجتها عن طريق الكمبيوتر وهي مصممة لجعل عملية استخدام الإلكترونيات التفاعلية في مشاريع متعددة التخصصات أكثر سهولة. يعتبر المتحكم الدقيق على اللوحة هو العنصر الاساسي فيها, في حين ان باقي اجزاء الدائرة تعمل على توفير الطاقة المناسبة للمتحكم للعمل وربطه مع الاجزاء الخارجية كالحاسبة او المتحسسات او المفاتيح .... الخ من مدخلات و مخرجات تربط الى اللوحة.\n" +
                "\n" +
                "تعتمد لوحات التطوير المختلفة للآردوينو على المتحكم الدقيق نوع Atmel بصورة اساسية حيث يمكنك تحميل البرامج الى هذا المتحكم مباشرة في حال عدم رغبك بإستخدام لوحات التطوير, لكن وجود هذه اللوحات و بأسعار مناسبة يسهل عليك التعامل مم هذه المتحكمات و برمجتها. يمكنك ايضاً استخدام لوحات التطوير لبرمجة المتحكم و من ثم نقله الى دائرة من تصميمك في حال عدم رغبتك بإستخدام لوحات التطوير في التصميم النهائي.\n" +
                "هناك الكثير انواع لوحات التطوير, قد يعد Arduino Uno اكثرها شيوعا, كما هناك الكثير من المصنعين لهذه اللوحات بإعتبارها مفتوحة المصدر. لذلك فإنك قد تستطيع الحصول عليها بأسعار زهيدة جدا تناسب الجميع من المحترفين او الهواة على حد سواء.\n" +
                "\n" +
                "لاحظ وجود بعض لوحات التطوير التي تحتوي على متحكمات SMT (Surface-Mount Technology) تكون بأسعار اقل لكن يكون من الاصعب نقل المتحكم الى دائرة من تصميمك لصعوبة لحام هذا النوع من المتحكمات. فكر ايضا اذا احتجت الى تغيير بسيط في البرنامج فأنت بحاجة الى اعادة المتحكم الى لوحة التطوير!. لذلك فإن هذا النوع من لوحات التطوير يناسب الهواة و محبي التعلم اكثر من المشاريع الاحترافية.\n" +
                "\n" +
                "\n" +
                "العمل على الآردوينو:\n" +
                "\n" +
                "للعمل على الادروينو فأنت بحاجة الى مجموعة من المواد الاكترونية الاساسية اضافة الى حاسبة يمكنك ربط الاردوينو اليها و يكون الربط على الاغلب عن طريق منفذ الـ USB. التالي قائمة بما تحتاجة لتبدأ تعلم الاردوينو.\n" +
                "\n" +
                "Arduino Uno\n" +
                "Bread board مع اسلاك و مصدر للطاقة\n" +
                "مجموعة من المقاومات و دايودات باعثة للضوء LED\n" +
                "بيئة التطوير المتكاملة للآردوينو (Arduino IDE): وهي عبارة عن برنامج يمكنك تحميله على حاسوبك لتتمكن من كتابة برامج الاردوينو و تحميلها الى المتحكم في لوحة التطوير.","الأردوينو",R.drawable.ardu1_2,1,"1. Arduino Uno:\n" +
                "هو لوح أردوينو يعتمد على الميكروكنترولر من النوع ATmega328P و(الداتا شيت). ويحتوي على 14 مداخل ومخارج Digital (منها 6 يمكن استخدامها كمخارج PWM)، ويضاً على  6 مداخل Analog، ومفتاحين Reset ,ICSP وتحتوي على باقي المكونات التي تضمن عمله بشكل جيد. ويحتاج فقط لتشغيل توصيله بالكمبيوتر بكابل USB او من خلال محول ومنظم الجهد AC-to-DC او بطارية لكي يبدأ العمل. لوحة Arduino Uno هي الأولى في سلسلة لوحات اردوينو USB. ويوجد منه نوعان (PTH) والنوع الآخر (SMD) وهم نفس الوظائف.\n" +
                "\n" +
                "2. Arduino Leonardo:\n" +
                "هو لوح مشابه للـ UNO ويعمل بالمتحكم ATmega32u4 (داتاشيت). يحتوي على 20 من مداخل ومخارج Digital (و7 منهم يمكن استخدامهم كمخارج لـ PWM و12 كمداخل Analog). ويحتوي على كريستال 16MHz، سوكيت USB Micro ومقبس للتغذية بالطاقة وايضاً مفتاحين الـ Reset و ICSP. ويحتوى على كل ما يحتاجه المايكروكنترولر للعمل ويتم توصيله بالكمبيوتر بمخارج USB لامداده بالطاقة وايضاً يتم تغذيته بواسطة محول او منظم جهد 5 فولت او بطارية لتشغيله.\n" +
                "ويمتاز لوح Leonardo بإنه يعمل بالمتحكم ATmega32u4 ويمتاز هذا المتحكم بإنه يحتوى على مخاطب عبر USB داخله، لذلك لا داعي لاستخدام معالج ثانوي كباقي لوحات الأردوينو الآخرى. مما يسمح باستخدامه مع الكومبيوتر كفارة أو لوح مفاتيح وسرعة المتحكم 16MHz والذاكرة 32KBit.\n" +
                "\n" +
                "3. Arduino 101:\n" +
                "لوح Arduino 101 هو نوع متطور من UNO مع مداخل ومخارج اقل منه. لوح تعليمي متطور موفر للطاقة والمتحكم الذي يعمل به هو Intel® Curie™ Module مصنع من شركة انتيل، مع نفس بساطة عمل لوح الاردوينو. غير انها تمتاز بخاصية البلوتوث التي تتيح للوح للاتصال بالعالم الخارجي من حوله. ويضمن لك تصميم المشاريع التي تعتمد على البلوتوث. Bluetooth LE, 6-axis accelerometer/gyro.  يحتوي على 14 مخرج ومدخل Digital منهم (4 مخارج يمكن استخدامهم كمخارج PWM و6مداخل Analog).\n" +
                "\n" +
                "4. Arduino Esplora:\n" +
                "لوح الاردوينو Esplora هو لوح يعمل على المايكروكنترولر ATmega32u4 مع 16 MHz crystal مستمد فكرتها من لوح الاردوينو Leonardo، كما ذكرنا في لوح Leonardo بانه يتم تعريفه على الكومبيوتر كماوس او كاي بورد مما يعتيه تواصل مباشر مع الكومبيوتر بدون الحاجة لمعالج ثانوي. فلوح Esplora هو ايضاً مثله ولكن مع مفاتيح ومخارج تحكم اكثر منه واضافة الى ذلك حساسات متعددة الوظائف مثل حساس الضوء ,حساس درجة الحرارة ,مقياس التسارع accelerometer ,مدخلان ومخرجان للTinkerKit,منبه buzzer . ويحتوى لوح Esplora على عصا تحكم , منزلق, مداخل للصوت والضوء مداخل للحساسات الخارجية. مع امكانية اضافة له شاشة ملونة LCD من النوع  TFT LCD Screen.\n" +
                "\n" +
                "5. Arduino Due:\n" +
                "تختلف هذه اللوحة عن غيرها من لوحات الأردوينو بإنها تعمل على 3.3v ولاتقبل 5V وتعتبره High Voltage مما يؤدي الى عدم استطاعتها الارتباط مع بعض انواع الشيلد Shields ويعمل لوح Arduino Due بمتحكم من نوع AT91SAM3X8E (الداتاشيت) ويعمل المتحكم على 32-bit. يحتوى لوح Due على 54 مداخل/خرج Digital (و12منهم يمكن استخدامهم كمخارج PWM)، بالاضافة إلى 12 مدخل Analog و2 مخرج analog.ويمتاز بأنه يحتوى على منفذين للـ micro USB: واحدة لإتصالها بالكومبيوتر وامدادها بالطاقة والاخرى تعمل كـ OTG اي انه يمكن توصيل الوح مع الاجهزة التي تعمل بـ USB. وتبلغ سرعة المتحكم 84MHz.\n" +
                "\n" +
                "6. Arduino Mega2560:\n" +
                "تم تصنيع هذه اللوحة للمشاريع الكبيرة والمعقدة والتي تحتاج إلى مكونات الكترونية كثيرة تتصل بها. لوح 2560 Arduino Mega يعمل بالمايكروكنترولر من النوع ATmega2560. ويحتوى لوح الاردوينو Mega2560 على 54 مدخل/مخرج Digital و ( 15 يمكن استخدامهم كـمخارج لـ PWM) و16 مدخل analog، ويحتوى على 4 UARTs (hardware serial ports)، ويعمل بكريستالة 16MHz.\n" +
                "ويحتوى ايضاً على المفاتيح الاساسية مثل reset , ICSP header، والمنافذ الاساسية ايضاً مثل مدخل لل يو اس بي USB ومدخل البور. مع امكانية امداده بالطاقة من كل من المنفذين او من خلال بطارية.\n"));
        mList2.add(new ModelClass(R.drawable.resistor1,"ما هي المقاومات؟","هي مكون كهربائي تتم إضافته إلى الدارة الكهربائية بهدف تنظيم التيار الوارد إلى هذه الدارة، عن طريق تبديد التيار الزائد عن الحد الذي تسمح به إلى حرارة، مما يجعله أحد أهم المكونات في الدارات الإلكترونية الحساسة.\n" +
                "\n" +
                "تختلف المقاومات في قيمتها و يعبر عنها بوحدة الأوم، وشدَّة التيار الذي تمرره المقاومة تتناسب عكسًا مع قيمة هذه المقاومة.\n" +
                "\n" +
                "ممَّ تصنع المقاومات\n" +
                "تصنع المقاومات من مواد مختلفة عازلة وموصلة، تحدد كمية هذه المواد ونسبها بين بعضها قيمة المقاومة، وتصنع بعضها من أسلاك نحاسية ملفوفة حول قضيب من السيراميك، ومطلية من الخارج بمادة عازلة.\n" +
                "\n" +
                "تحدد ثخانة السلك من جهة، وعدد اللفات حول القضيب السيراميكي من جهة أخرى قيمة هذه المقاومة، إلَّا أن هذا التصميم قليل الاستخدام بسبب الحجم الكبير الذي يتطلبه، ويستعاض عنه بالمقاومات الكربونية التي يتم استخدام الكربون فيها بدلًا من أسلاك النحاس.1\n" +
                "\n" +
                "طرق الوصل\n" +
                "هناك طريقتان لوصل المقاومات إلى الدارة الكهربائية، فإما نقوم بتوصيلها بشكل متتالٍ، ويسمى الربط على التسلسل وفيه يكون فرق الكمون مقسمًا بينها، أما التيار فيكون ثابتًا.\n" +
                "\n" +
                "في الطريقة الأخرى، يتم وصلها بشكل متوازٍ، ويسمى الربط على التفرع، وهنا يكون فرق الكمون بين أطراف هذه المقاومات متساويًا بينما يقسم التيار بينها.\n" +
                "\n" +
                "تكون درجة التعقيد أكبر في بعض الدارات؛ وذلك لاحتوائها على مقاومات مربوطة على التسلسل وأخرى موصولة على التفرع.","المقاومات",R.drawable.resistors2,1,"تقسم المقاومات حسب تكوينها كما ذكرنا مسبقًا إلى مقاومات سلكية وأخرى كربونية، أمَّا حسب الخصائص والوظيفة فتقسم إلى أنواع عديدة.\n" +
                "\n" +
                "المقاومات الثابتة: تكون هذه إما سلكية أو كربونية، ولها قيمة ثابتة لا تتغيَّر قد تكون مكتوبة عليها بشكل أرقام، أو يمكن حسابها من خلال الألوان المطبوعة عليها عن طريق استخدام الدليل اللوني، حيث تحاط بأربع حلقات؛ تمثل الحلقتان الأولى والثانية الخانتين الأولى والثانية من قيمة المقاومة، بينما تمثل الحلقة الثالثة عامل الضرب وهو عشرة مرفوعة إلى أس يدل عليه اللون، والحلقة الرابعة تشير إلى سماحية المقاومة.\n" +
                "المقاومات المتغيرة: تحوي على مزلقة أو قرص للتحكم لتغيير قيمتها، وفي بعض أنواعها يكون التحكم في قيمة المقاومة إلكترونيًّا من دون الحاجة إلى حركة ميكانيكية لفعل ذلك، وتتميز المقاومات المتغيرة بشكل عام بنسبة سماحية كبيرة تبلغ 20% مقارنة بالمقاومات الثابتة التي تكون فيها 5%.\n" +
                "الثرمستور: أو كما تعرف بالمقاومة الحرارية الموجبة؛ وذلك لأنها تتحسس لدرجة الحرارة وتزداد تدريجيًا بارتفاع الحرارة، وهذا يجعلها تستخدم في أجهزة الحماية الحرارية، ومستشعرات درجة الحرارة.\n" +
                "مقاومات الكمون المتغير (Varistors): تتغير قيمة هذه المقاومة بتغير فرق الكمون بين طرفيها؛ وتنقص قيمتها كلما زاد مقداره، وهذا يجعلها مناسبة للاستخدام في الحماية من الجهد الزائد.\n" +
                "المقاومات الضوئية: تعتمد شدة هذه المقاومة على شدة الضوء وتناسب طردًا معها؛ فتنخفض بانخفاض شدة الضوء وتزداد بازديادها، وتستخدم لتطبيقات مختلفة، منها تشغيل أضواء الشارع في الليل وإيقاف تشغيلها في النهار.\n" +
                "المقاومات المغناطيسية: يعتمد هذا النوع من المقاومات على الحقل المغناطيسي، وتختلف باختلاف شدته وجهته.2"));
        mList2.add(new ModelClass(R.drawable.comp3_1,"ما هي الحساسات؟","تعمل الحساسات على تحسين نمط معيشتنا وجعل حياتنا أفضل ومهامنا أسهل، فهي تقوم بإنارة مصباح الغرفة بمجرد أن تستشعر وجودنا، وتُعدل درجة حرارة المنزل بصورة آلية، وتنبهنا في حالة وجود حريق أو تصاعد دخان، وتفتح لنا الباب بمجرد أن نقترب منه، وتُحضر لنا القهوة التي نُحبها وغيرها الكثير من المهام المختلفة والمتنوعة.\n" +
                "\n" +
                "جميع المهام التي ذكرناها سابقا والعديد من مهام الأتمتة (automation) الأخرى ممكنة ومن السهل تجسيدها على أرض الواقع بفضل الحساسات، لذا دعونا نتعرف في هذه المقالة على أنواعها المختلفة وتطبيقاتها العديدة والمجالات التي تُستعمل فيها.\n" +
                "\n" +
                "ما هو الحساس؟\n" +
                "هناك العديد من التعريفات المختلفة التي تحدد ماهية الحساس لكن يبقى أفضلها (بالنسبة لي) هو: إن الحساس عبارة عن جهاز يقوم بتحويل كمية فيزيائية مثل الضغط ودرجة الحرارة والإشعاع والموضع والشدة الضوئية إلى كمية كهربائية تتمثل في الجهد أو التيار أو الشحنة.\n" +
                "\n" +
                "من أبسط الأمثلة حول الحساسات مثال المقاومة الضوئية، وهي عبارة عن عنصر إلكتروني تتغير مقاومته وفقا لشدة الضوء المسلط عليها، حيث توجد بينهما علاقة عكسية، فكلما زادت حدة الضوء الذي يسقط على المقاومة الضوئية نقصت قيم هذه الأخيرة، وعندما تتناقص حدة الضوء المسلط على المقاومة الضوئية تزداد قيمتها.\n" +
                "\n" +
                "تصنيف الحساسات:\n" +
                "هناك العديد من التصنيفات الممكنة للحساسات، بعضها سهل وبسيط، وبعضها الآخر صعب ومعقد، سنقوم في هذه المقالة إن شاء الله بإستعراض التصنيف الأسهل والأكثر شيوعًا، حيث أن المجسات تُصنف إلى مجموعتين:\n" +
                "حساسات تُولد فرق جهد (active sensors): تتصرف مثل مولد للطاقة حيث تقوم بتحويل الطاقة المرتبطة بالكمية الفيزيائية إلى طاقة كهربائية (تيار أو جهد أو شحنة) وتستطيع هذه الحساسات أن تعمل حتى دون وجود مصدر تغذية خارجي. مثال: الخلايا الكهروضوئية تقوم بتحويل الشدة الضوئية إلى تيار أو جهد كهربائيين.\n" +
                "حساسات لا تولد فرق جهد (passive sensors): تتصرف كممانعة متغيرة، ولهذا من أجل أن تقوم بإعطائنا جهد كهربائي (أو تيار أو شحنة) عند الخرج يجب أن نقوم بتوصيلها مع مصدر تغذية خارجي. مثال: يمكننا إستخدام المقاومة المتغيرة كمجس للحركة.","الحساسات",R.drawable.comp3_2,1,"حساس الحرارة:\n" +
                "يُعتبر حساس الحرارة من بين أنواع الحساسات الأكثر استعمالًا، تتمثل وظيفة هذا الحساس في قياس تغيرات درجة الحرارة مثلما يدل على ذلك اسمه.\n" +
                "في حساسات الحرارة، كلما تغيرت درجة حرارة المحيط تغيرت بعض خصائص الحساس الفيزيائية مثل المقاومة أو الجهد الكهربائي.\n" +
                "\n" +
                "هناك العديد من الحساسات المختلفة للحرارة مثل: الحساس LM35، المقاومة الحرارية، المزدوجة الحرارية...الخ\n" +
                "\n" +
                "تُستعمل الحساسات الحرارية في كل مكان من حولنا، فهي موجودة في الحواسيب، والهواتف الذكية، والسيارات، ومكيفات الهواء وغيرها الكثير.\n" +
                "\n" +
                "إذا أردت أن تفهم هذا النوع من الحساسات أكثر يمكنك إلقاء نظرة على إحدى مقاليتنا السابقتين اللتين تطرقنا فيهما إلى: عرض درجة الحرارة بواسطة الأردوينو والحساس LM35، وإستخدام المقاومة الحرارية مع الأردوينو.\n" +
                "\n" +
                "الحساسات التقاربية:\n" +
                "الحساس التقاربي عبارة عن حساس غير لمسي (non-contact sensor) يكشف عن وجود جسم ما بالقرب، ويمكن تقسيمه إلى عدة أنواع فرعية مثل: الحساس التقاربي الحثي (Inductive proximity sensor)، والحساس التقاربي السعوي (Capacitive proximity sensor)، والحساس التقاربي الضوئي (Optical proximity sensor).\n" +
                "تشمل بعض تطبيقات الحساسات التقاربية الهواتف الذكية، والسيارات، والطائرات وغيرها الكثير.\n" +
                "\n" +
                "حساسات الموجات تحت الحمراء:\n" +
                "حساسات الموجات تحت الحمراء عبارة عن حساسات ترتكز في مبدأ عملها على الضوء، وهي تُستعمل عادة من أجل معرفة البعد في أغلب الهواتف الذكية الموجودة اليوم.\n" +
                "هناك نوعان من حساسات الموجات تحت الحمراء، الحساسات المُرسِلة والحساسات العاكسة.\n" +
                "\n" +
                "الحساسات المُرسِلة (Transmissive): مُرسل الأشعة تحت الحمراء (عادة ما يكون عبارة عن ليد أشعة تحت حمراء IR LED) ومُستقبِل الأشعة تحت الحمراء (عادة ما يكون دايود ضوئي) يوضعان بحيث يكونان مقابلان لبعضهما البعض، وعندما يمر بينهما جسم يستشعر الحساس وجوده.\n" +
                "الحساسات العاكسة (Reflective): في هذه الحالة يتم وضع المستقبل والمرسل جنبًا إلى جنب بحيث يقابلان الجسم، عندما يمر جسم أمامهما (المرسل والمستقبل) يستشعر الحساس وجود الجسم.\n" +
                "\n" +
                "من بين تطبيقات حساسات الأشعة تحت الحمراء، الهواتف المحمولة، والسيارات والروبوتات... الخ\n" +
                "\n" +
                "حساس الموجات فوق صوتية:\n" +
                "حساس الموجات فوق صوتية عبارة عن حساس غير لمسي يُستخدم من أجل قياس المسافة وكذلك سرعة جسم معين، يتعامل هذا الحساس مع أصوات يفوق ترددها التردد الأقصى الذي يمكن أن يسمعه الإنسان (20 كيلوهيرتز)\n"));
        mList2.add(new ModelClass(R.drawable.rfid1,"ما هو ال RFID ؟","• ما هو ال RFID:\n" +
                "كلمة RFID هي إختصار لكلمة Radio frequency Identification\n" +
                "وهذا يعني\n" +
                "تحديد الهوية باستخدام موجات الراديو. والتقنية عبارة عن تحديد الهوية بشكل تلقائي وذالك بإستخدام اجهزة  متخصصة في عملية إلتقاط إشارات تصدرها RFID Tags \n" +
                "وهي قطعة صغيرة جدا يمكن اي تأخد اشكال متعددة تستطيع إدراجه في منتجات أو الحيوانات أو الإنسان هذه هذه القطعة  والتي اطلقنا عليها إسم RFID Tags\n" +
                "فهو يحتوي على شريحة مصنوعة من السيلكون وهوائي لكي يستطيع استقبال وإرسال البيانات والاستعلامات من خلال موجات الراديو\n" +
                "• تصنيفات ال RFID :\n" +
                "1. Passive RFID \n" +
                "2.Active RFID \n" +
                "3. Semi passive\n" +
                "الاختلاف الحقيقي بين التصنيفات المدرجة اعلاه ان الاولى لا تحتاج إلى شحنة كهربائية لتعمل (تذكر نحن نتحدث عن رقاقات صغيرة يثم إدراجها يعني ليست موصلة بخيط كهرباء ) اما الثانية والثالثة فهي تحتاج إلى بطارية لكي يثم تغذيتها \n" +
                " • بعض المشاكل التي تحصل  على مستوى ال RFID :\n" +
                " من المشاكل الشائعة والتي تحدث على مستوى ال RFID\n" +
                "هي مشاكل ال collisions\n" +
                " لهذا يتم التفريق بين مستويين اساسيين\n" +
                "1- RFID tags على مستوى\n" +
                "2- RFID Readers على مستوى\n" +
                " على مستوى ال RFID tags :\n" +
                " وهي عندما تلتقي إشارتين او عدت إشارات يتم إرسالها من طرف RFID Tags\n" +
                " ويجب على ال RFID reader Tags\n" +
                "ان يقوم بتحليلها كل على حدى في نفس الوقت مما يستحيل على القارئ القيام بذالك \n" +
                " على مستوى ال RFID Readers :\n" +
                " قد يتسبب فيه قارئ اواكثر عندما يكون احد يقوم بتغطية لمساحة تتجاوز مساحة قارئ اخر مما ينشب عنه تذاخل في الموجات التي ترسلها القارئات RFID reader Tags\n" +
                "RFID الاخطار الامنية التي تهدد ال\n" +
                "Sniffing \n" +
                "Tracking\n" +
                "Spoofing\n" +
                "Replays attacks \n" +
                "Danial of service \n" +
                "1) Sniffing\n" +
                "رقاقة ال  RFID Tags  تسمح لنفسها ان يثم قرائتها من قبل اي   RFID Tags reader\n" +
                " ولهذا فإنه من السهل ان يثم قرائة المعلومات المتواجدة ب RFID tag\n" +
                " وذالك بالتجسس على قنوات ال RFID\n" +
                " وذالك في حالة إذا لم يكن هناك نظام حماية يسمح بعملية حصر ل  RFID Tags Reader التي لها الصلاحية في قراءة محتوى RFID tag .\n" +
                "3)RFID Tracking\n" +
                " تكنولوجيا ال RFID\n" +
                " تسمح لك بتتبع وتقفي اثار المنتجات الحيوانات الانسان ... الذين يحملون RFID tag\n" +
                "  ولهذا فإن RFID tags readers يتم وضعها في اماكن إتستراتيجية للقيام بتسجيل  تجاوب RFID tag\n" +
                " من خلال فقط تسجيل الاشخاص الذين يتوفرون على identity معينة ومعرفة \n" +
                "ففي غياب هاته الاخيرة فإنه يسهل على المتقفي او tracker\n" +
                " من تتبع اي شخص يحمل RFID TAG\n" +
                "من دون اية مشاكل او عناء!!\n" +
                "4)Spoofing\n" +
                " يستطيع المخترق هنا من القيام بخلق RFID tag\n" +
                "تكون مشابة للأصلية وذالك بالإعتماد على المعلومات التي جمعها عن RFID Tag الاصلية  \n" +
                "replay attacks \n" +
                "ويتم هذا النوع من الهجوم بإستعمال اجهزة مختصة في إرسال عدة طلبات بل ويتم  التعسف في إرسال الطلبات حتى يحصل على encrypted ID الخاصة ب    RFID tags\n" +
                "5) Danial of service\n" +
                " يرتكز هذا النوع من الهجوم على إستثمار ثغرات RFID Tags   وقاعدة البيانات الخاصة ب RFID Tags\n" +
                " والتي تتواجد بها Tags  الخاصة ب RFID","RFID",R.drawable.rfid2,1,"أنواع رقاقات RFID\n" +
                "\n" +
                "يمكن تصنيف رقاقات RFID اعتماداً على عوامل عدة، ورغم أننا ذكرنا أن هذه البطاقات لا تعتمد على بطارية كمصدر للطاقة إلاّ أن هذا الشرط لا ينطبق على كل الأنواع. هنالك نوعان رئيسيان من بطاقات RFID هما:\n" +
                "\n" +
                "الرقاقات النشطة (Active Tags)\n" +
                "التي تعتمد على بطارية، وجود البطارية يجعل هذه الرقاقة تتواصل حتى 100 متر، بعض هذه الرقاقات مستقل تماماً عن حقل القارئ إذ أنها متكاملة مع وحدة إرسال خاصة مما يجعلها قادرة على التواصل لمسافة عدة كيلومترات باعتماد مبدأ الرادارات[4]. قد يكون القارئ محمولاً بحيث لا يتجاوز وزنه النصف كيلوغرام ومزوداً بذاكرة سعتها أكثر من 128 ميغابايت ومن الممكن أن يتصل بالحاسوب لاسلكياً.\n" +
                "\n" +
                "الرقاقات الخاملة (السلبية) (Passive Tags)\n" +
                "التي لا تعتمد على بطارية، عدم وجود مصدر الطاقة المستقل يحد من قدرة الإرسال الخاصة بهذه الرقات إلى عدة أمتار فقط، تتم تغذية هذه الرقاقة كما ذكرنا سابقاً بواسطة طاقة الموجات الكهرومغناطيسية. وتتناقص قدرة مجال القارئ بسرعة مع ازدياد المسافة مما يحدد مجال قراءتها إلى مسافة 4-5 متر باستخدام الترددات العالية جداً 860-930 MHz.\n" +
                "\n" +
                "و يوجد شكل سيتم تحميله يبين مكونات الرقاقات الموجبة والسالبة[5].\n" +
                "\n" +
                "كل من هذين النوعين يتميز بصفات عن الآخر، والجدول التالي يقارن بينهما:[3]\n" +
                "\n" +
                "الرقاقات النشطة\tالرقاقات الخاملة\n" +
                "مصدر الطاقة\tبطارية\tالطاقة الصادرة عن القارئ\n" +
                "توفير الطاقة\tدوماً\tعند القراءة فقط\n" +
                "التردد\t455 GHz,2.45 GHz,5.8 GHz\tمختلفة من الترددات المنخفضة إلى المرتفعة UHF\n" +
                "مسافة القراءة\tتصل إلى 100 متر\tمن مترين إلى 5 أمتار\n" +
                "حجم الذاكرة\tتصل إلى 128 كيلو بايت\tتصل إلى 256 بايت\n" +
                "جاهزية العمل\tتكون دوماً في حالة تأهب وتنشط عند وصول الإشارة من القارئ\tلا تعمل سوى بحالة القراءة وتكون الاستجابة بطيئة نسبياً\n" +
                "الصيانة الدورية\tتحتاج\tلا تحتاج\n" +
                "الاستعمال\tعادة على صناديق الشحن الكبيرة\tعادة على المعلبات والأشياء الصغيرة\n" +
                "السعر\t10 – 100 دولار\tدولار واحد\n" +
                " الرقاقات شبه الخاملة (شبه السلبية) (Semi-Passive Tags)\n" +
                "مشابهة للرقاقات النشطة باعتمادها على مصدر طاقة خاص بها، ولكن البطارية موجودة داخل الشريحة ونتيجة لذلك يكون بإمكان الهوائي إرسال واستقبال المعلومات فقط وهذا يجعل هذا النوع أسرع من الرقاقات السلبية، كما أنها تتميز بـ:-\n" +
                "\n" +
                "أنها حساسة أكثر من الرقاقات السلبية.\n" +
                "تدوم البطارية لفترة أطول من الرقاقات النشطة.\n" +
                "يمكن أن تؤدي وظائف نشطة (مثل تسجيل درجات الحرارة) باستخدام طاقتها الخاصة حتى بغياب القارئ.\n" +
                "الرقاقات ذات القابلية العالية (Extended Capability)\n" +
                "لهذه الرقاقات قدرات عالية جداً تفوق القدرات الأساسية لرقاقات الـ RFID كلوحة ترخيص أو كبديل لتقنية الترميز العمودي (Bar-code)، تتميز هذه الرقاقات بـ:-\n" +
                "\n" +
                "قدرتها على إرسال واستقبال البيانات لمسافات عالية جداً.\n" +
                "قدرتها على العمل في البيئات الصعبة.\n" +
                "قدرة تخزين عالية جداً على البطاقة.\n" +
                "قدرتها على التكامل مع المجسات.\n" +
                "قدرتها على التواصل مع الأجهزة الخارجية.\n" +
                "قدرتها على تحمل تقلبات الطقس."));
        mList2.add(new ModelClass(R.drawable.button1,"ما هي Push Buttons ؟","من اكثر المكونات استخداما فى دوائر التحكم الالى او plc هى مفاتيح push button لذلك يجب فهم كيفية عملها جيدا حتى يمكننا التعامل مع التحكم الالى\n" +
                "استخداماته : يستخدم فى تشغيل او ايقاف محرك او اكثر من محرك .. كما يمكن استخدامها فى اشياء اخرى حسب التطبيق","Push Buttons",R.drawable.button2,1,"انواع مفاتيح push buttons\n" +
                "\n" +
                "نوع NO اى normally opened : و يكون دائما مفتوح و عند الضغط عليه يتحول الى closed و عند رفع اليد يرجع الى مفتوح\n" +
                "\n" +
                "2- نوع NC اى normally closed : و يكون دائما مغلق و عند الضغط عليه يفتح و عند رفع اليد يتحول مرة اخرى الى مغلق\n" +
                "\n" +
                "2- نوع مزدوج NO , NC : و هذا النوع به نقطتين احدهما NO و الاخرى NC و عند الضغط عليه يحول المفتوح الى مغلق و المغلق الى مفتوح و عند رفع اليد يتم ارجاع الموضع الاصلى\n" +
                "\n" +
                "ينقسم النوع المزدوج الى نوعين :\n" +
                "\n" +
                "- نوع electricaly separated اى ان النقطتين NO,NC غير متصلين كهربيا\n" +
                "\n" +
                "- نوع electricaly connected اى له نقطة common تصل ال NO بال NC\n" +
                "\n" +
                "و يتم الاختيار بينهم حسب الدائرة\n" +
                "\n" +
                "كيفية شراء مفتاح push button\n" +
                "\n" +
                "يتم شراء المفتاح حسب نوعه و حسب اقصى قيمة للتيار يتحملها\n" +
                "\n" +
                "عادة يكون المفتاح ال NO لونه اخضر و المفتاح ال NC لونه احمر"));
        mList2.add(new ModelClass(R.drawable.esp1min,"ما هي قطعة esp؟","معظم الناس يطلقون على ESP8266 كوحدة WIFI ، لكنها في الواقع متحكم. ESP8266 هو اسم المتحكم الدقيق الذي طورته شركة Espressif Systems وهي شركة مقرها شنغهاي. هذا متحكم لديه القدرة على أداء الأنشطة المتعلقة WIFI وبالتالي يستخدم على نطاق واسع كوحدة WIFI.\n" +
                "اك العديد من أنواع الوحدات ESP8266 المتاحة تتراوح بين ESP8266-01 و ESP8266-12. والذي نستخدمه في البرنامج التعليمي هو ESP8266-01 لأنه الأرخص والمتاح بسهولة. ومع ذلك ، تحتوي جميع وحدات ESP على نوع واحد فقط من معالج ESP ، وما يختلف هو نوع شريط الاختراق المستخدم فقط. ستحتوي اللوحة الجانبية ESP8266-01 على دبابيس GPIO فقط بينما ستكون أعلى في اللوحات الأخرى.\n" +
                "حسنًا ، بعض الأشياء التي كان من الممكن أن تفاجئك بالمواصفات هي أن وحدة ESP8266 تأتي مع محول ADC وتستهلك تيارًا مرتفعًا جدًا يبلغ 0.8A أثناء وميض جهازك.\n" +
                "\n" +
                " \n" +
                "\n" +
                "أساسيات نظرية WiFi:\n" +
                "بروتوكول التحكم في النقل (TCP) ، بروتوكول الإنترنت (IP) ، بروتوكول مخطط بيانات المستخدم (UDP) ، نقطة الوصول (AP) ، المحطة (Sta) ، معرف مجموعة الخدمات (SSID) ، واجهة برمجة التطبيقات (API) ، خادم الويب …. .\n" +
                "هل كل الشروط المذكورة أعلاه منطقية بالنسبة لك؟\n" +
                "إن كان جوابك نعم، فيمكنك القفز هذا الجزء والانتقال إلى القسم التالي. وإن كان جوابك لا، فعليك معرفة هذه الشروط لأنه عندها فقط يمكننا الدخول في عالم انترنت الأشياء.\n" +
                "\n" +
                "بروتوكول التحكم في النقل (TCP):\n" +
                "هي مجموعة القواعد التي يعتمد عليها الإنترنت. حيث أن ESP8266 لديه القدرة على إعداد اتصالات WIFI. على مستوى عالٍ من شبكة Wi-Fi هي القدرة على المشاركة في اتصالات TCP / IP عبر وصلة لاسلكية. يمكنك جعل ESP الخاص بك يعمل على بروتوكول TCP / IP أو بروتوكول UDP.\n" +
                "\n" +
                "بروتوكول مخطط بيانات المستخدم (UDP):\n" +
                "UDP هو أيضا نوع آخر من بروتوكول الإنترنت. هذا النوع من الاتصالات أسرع من TCP ولكنه أقل دقة. السبب هو أن TCP يستخدم الاعترافات أثناء اتصاله ولكن UDP لا يستخدم. يستخدم بروتوكول TCP في الغالب في الشبكات التي يوجد فيها متطلبات موثوقية عالية. يتم استخدام UDP في الأماكن التي تتمتع فيها السرعة بأولوية أعلى من الموثوقية. على سبيل المثال ، يتم استخدام UDP في مؤتمرات الفيديو ، لأنه حتى إذا لم يتم إرسال بعض وحدات البكسل ، فلن يؤثر ذلك على جودة الفيديو كثيرًا ولكن السرعة مهمة جدًا.\n" +
                "تعمل معظم المشاريع والرموز ESP8266 حول TCP / IP ، UDP سيكون أقل عناء.\n" +
                "\n" +
                "نقطة الوصول (AP) والمحطة (STA):\n" +
                "بمجرد البدء في العمل مع وحدة ESP ، ستصادف هاتين المصطلحين بشكل متكرر. دعنا نقول لك أنت وصديقك ترغب في تصفح الإنترنت على الهواتف الذكية الخاصة بك ولكن بما أنه ليس لديه اتصال إنترنت نشط ، فإنك تقرر تشغيل نقطة الاتصال الخاصة بك ويتصل صديقك به. هنا هو هاتفك الذي هو مصدر اتصال بالإنترنت هو نقطة الوصول (AP) وهاتف صديقك الذي يستخدم الإنترنت يسمى محطة (STA).\n" +
                "يمكن استخدام وحدة ESP8266 في ثلاثة أوضاع ، وضع AP ، وضع STA أو في كل من وضع STA و AP (مجتمعين).\n" +
                "\n" +
                "معرف مجموعة الخدمة (SSID):\n" +
                "هذا هو مصطلح بسيط إلى حد ما. تقريبا جميعنا قد استخدم WIFI. يسمى اسم شبكة Wi-Fi SSID الخاص به. عندما يكون لدينا نقاط وصول متعددة لمحطة للاتصال بها ، يجب أن تعرف المحطة نقطة الوصول التي يجب أن تكون متصلاً بها ، ومن ثم يتم إعطاء هوية لكل نقطة وصول (AP) تعرف باسم SSID.\n" +
                "\n" +
                "واجهة برمجة التطبيقات (API):\n" +
                "لتبسيط الأمر ، تعد واجهة برمجة التطبيقات (API) بمثابة برنامج مراسلة يأخذ طلباتك ويعالجها ويعيد النظام إلى النتيجة المرغوبة. تستخدم معظم الأنشطة التي نقوم بها على الإنترنت واجهات برمجة التطبيقات ، مثل عند حجز رحلة ، وإجراء عملية شراء عبر الإنترنت ، إلخ. كل مواقع الويب تربطك بواجهة برمجة التطبيقات حيث يتم جزء من العمل مثل الاشتراك ، إجراء الدفع ، إلخ. هناك.\n" +
                "يستخدم ESP8266 API للتحدث إلى عالم الإنترنت. على سبيل المثال ، إذا كان يريد معرفة الوقت أو المناخ أو أي شيء يجب أن يطلبه في شكل واجهة برمجة تطبيقات لموقع الويب المقابل. سيتلقى موقع الويب هذا الطلب ويعيد النتيجة المرغوبة إلى وحدة ESP الخاصة بنا.\n" +
                "\n" +
                "قاعدة بيانات الانترنت:\n" +
                "خادم الويب هو شيء مسؤول عن عرض محتويات موقع الويب. سيتم تحميل جميع محتويات هذا الموقع بالذات على خادم الويب الخاص به. هناك أجهزة كمبيوتر مخصصة تتمثل مهمتها في العمل كخادم ويب فقط. يمكننا أيضًا برمجة ESP8266 لدينا للعمل كخادم ويب ، والاتصال به من أي مكان في العالم.\n" +
                "\n" +
                " \n" +
                "\n" +
                "أنواع البرمجة مع ESP8266:\n" +
                "هناك طريقتان للعمل مع وحدة ESP8266 الخاصة بك. سيساعدك هذا البرنامج التعليمي على البدء مع كليهما. طريقة واحدة هي باستخدام أوامر AT. الطريقة الأخرى هي استخدام Arduino IDE. دعونا نفهم ما يعنيه.\n" +
                "جميع وحدات ESP8266 التي يتم شحنها من المصنع سيكون لها برنامج ثابت افتراضي (SDK + API) يتم تحميلها فيه. ستساعدك هذه البرامج الثابتة في برمجة وحدة ESP8266 من خلال أوامر AT.\n" +
                "الطريقة الأخرى هي عن طريق برمجة وحدة ESP8266 مباشرة باستخدام Arduino IDE (اللوحة غير مطلوبة) ومكتباتها. جميع المشاريع يمكن القيام به في كلتا الطريقتين. ولكن ، إذا بدأت في استخدام Arduino IDE لبرمجة ESP8266 الخاص بك ، فقد لا تتمكن من استخدام أوامر AT لأن SDK الافتراضية قد تكون تالفة. في هذه الحالة ، يجب عليك فلاش ESP باستخدام الإعدادات الافتراضية. سوف نغطي ذلك في برنامج تعليمي آخر.\n" +
                "\n" +
                " ","قطعة esp",R.drawable.esp2,1,"هناك العديد من الانواع كماتجد في الصورة بالأعلي أشهرهم esp12"));
       mList2.add(new ModelClass(R.drawable.trans1,"ما هو الترانزيستور؟","الصفحة الرئيسيةعناصر إلكترونيةما هو الترانزستور؟ وكيف يعمل؟\n" +
               "ما هو الترانزستور؟ وكيف يعمل؟\n" +
               "حاتم زهير-أغسطس 31, 2019\n" +
               "الترانزستور أو المقحل هو العنصر الأهم والذي لا يمكن الإستغناء عنه في الإلكترونيات الحديثة. تتكون الدوائر المتكاملة (IC) من عدد كبير جدا من الترانزستورات المتضمنة في رقاقة واحدة صغيرة، نجد الترانزستورات أيضا في جميع التطبيقات والأجهزة الإلكترونية من حولنا فأهمية الترانزستور في الإلكترونيات الحديثة كأهمية العجلة بالنسبة للدراجة.\n" +
               "\n" +
               "ما هو الترانزيستور؟ وكيف يعمل؟\n" +
               "\n" +
               "يتيح لنا الترانزستور إمكانية التحكم في كمية كبيرة من التيار الكهربائي أو فولطية عالية بواسطة كمية صغيرة جدا من التيار أو فولطية جد منخفضة، مما يعني أننا يمكن أن نستخدمه في تكبير الإشارات (مثل: التيار...) أو كمفتاح.\n" +
               "\n" +
               "الترانزستور عبارة عن مادة شبه موصلة مطعمة بالسيليكون (أو الجرمانيوم في بعض الأحيان) تحتوي على بلورة رقيقة حيث تكون المنطقة الوسطى لها عبارة عن شبه موصل موجب والمنطقتان المحيطتان بها عبارة عن شبه موصل سالب، يمكن أن تكون أن المنطقة الوسطى شبه موصل سالب وفي هذه الحالة تكون المنطقتان الخارجيتان شبه موصل موجب.\n" +
               "إذا كانت العبارة السابقة عصية الفهم فلا تيأس وإليك هذا التشبيه الذي سيساعدك على استيعاب بنية المقحل أكثر: تخيل وكأن الترانزستور عبارة عن سندويتش، المنطقتان الخارجيتان هما قطعتا الخبز، أما المنطقة الوسطى فهي شريحة اللحم، إذا كانت قطعتا الخبز عبارة عن شبه موصل سالب فإن شريحة اللحم شبه موصل موجب والعكس صحيح.\n" +
               "مما سبق يمكننا أن نستنتج وجود نوعين من الترانزستور:\n" +
               "نوع NPN وهو الذي تكون منطقته الوسطى شبه موصل موجب (positive)\n" +
               "نوع PNP وهو الذي تكون منطقته الوسطى شبه موصل سالب (negative)\n" +
               "\n" +
               "تم إختراع الترانزستور على يد جون باردين، والتر براتين ووليام شوكلي خلال الحرب العالمية الثانية وبالتحديد سنة 1947 ولقد نال فريق العلماء هذا لاحقا سنة 1956 جائزة نوبل في الفيزياء نظير أعمالهم وأبحاثهم في مجال الترانزستورات (نال جون باردين جائزة نوبل مرة ثانية سنة 1972 وهذه المرة كانت نظير أبحاثه في مجال المواد فائقة التوصيل)","الترانزيستور",R.drawable.transistortypes,1,"ن نوعي الترانزستور يختلفان عن بعضهما اختلافا طفيفا في كيفية وضعهما في دائرة معينة فكل منها له ثلاثة اطراف تسمى في حالة المقحل ثنائى القطب بـ : القاعدة \"Base \" والباعث \"Emitter \" والمجمع \"Collector \" وبمرور تيار متغير في القاعدة سيظهر تأثره مجمعا في المجمع والباعث، وفي حالة مقحل تأثير المجال تسمى البوابة \"Gate \"، المنبع \"Source \"، المصب \"Drain \" ويتحكم الجهد على البوابة في فرق الجهد بين المنبع والمصب..\n" +
               "يمكن تقسيم المقاحل إلى عدة فئات حسب التقسيم::\n" +
               "\n" +
               "1:- طبقا لشبه الموصل:\n" +
               "\n" +
               "جرمانيومي- سليكوني – جاليومي – زرنخيى – كربيدي سليكوني\n" +
               "\n" +
               "2:- طبقا للبناء:\n" +
               "\n" +
               "BJT ثنائي القطب، MOSFET تأثير المجال، IGBT المقحل ذو البوابة المعزولة\n" +
               "\n" +
               "3:- طبقا للقطبية:\n" +
               "\n" +
               "NPN (س م س) المقحل من النوع السالب ويعنى منطقة من النوع السالب يليها منطقة من النوع الموجب يليها منطقة من النوع السالب\n" +
               "\n" +
               "PNP (م س م) المقحل من النوع الموجب ويعنى منطقة من النوع الموجبة يليها منطقة من النوع السالب يليها منطقة من النوع الموجب\n" +
               "\n" +
               "4:- طبقا لقدرة التشغيل:\n" +
               "\n" +
               "صغير – متوسط – كبير\n" +
               "\n" +
               "5:- طبقا لأقصى تردد تشغيل:\n" +
               "\n" +
               "موجات راديوية أو موجات الميكرومترية ويعطى أقصى تردد وفعال بجهد الثقل ويرمز له بالرمز FT والذي ينتج نسبة تكبير مساوية للوحدة .\n" +
               "\n" +
               "6:- طبقا للتطبيق المستخدم فيه:\n" +
               "\n" +
               "مفتاح – متعدد الأغراض – صوتي عالي الجهد – زوجي متماثل – عالي نسبة التكبير\n" +
               "\n" +
               "7:- طبقا للتغليف الفيزيائي:\n" +
               "\n" +
               "ذو الثقب المعدني - ذو الثقب البلاستيكي – المحمل سطحيا – سلسلة شبكة الكور – مغير القدرة\n" +
               "\n" +
               "8:- طبقا لمعامل التكبير (hfe):\n" +
               "\n" +
               "لذلك فان مقحل معين يمكن أن يوصف بهذا الوصف (سليكوني – ثنائي القطب من النوع السالب – مغير للطاقة عالي التردد – مفتاح)."));
    }
}
